app/controllers/pages_controller.rb

  def index
    @uid = params[:uid]
    version = params[:v]
    author = params[:u]

    if @uid
      # load page
      @page = Page.find_by_uid(@uid)

      @page.assign_author(author) if author

      # get content
      j = ActiveSupport::JSON
      @content = load_page(@page, version)
      @content = j.encode(@content)


      puts "\n"*5 + "rendered page with uid: " + @page.uid
      puts @content
      puts @uid
      puts author
      puts version
    else

      @page = Page.new
      @page.uid = Page.create_uid
      @page.title = "Page Title"
      @page.save
---
SELECT * FROM "pages" WHERE ("pages"."uid" = 'EVULPFk') LIMIT 1
INSERT INTO "pages" ("title", "user_id", "created_at", "updated_at", "root", "uid", "author") VALUES('Page Title', NULL, '2010-11-27 02:02:31', '2010-11-27 02:02:31', NULL, 'rE3WwMI', NULL)
UPDATE "pages" SET "updated_at" = '2010-10-09 21:12:21', "unique_id" = '3XK2jPW' WHERE "id" = 1

  def author
    @author = params[:author]
    @docs = Page.find(:all, :conditions => [ "author = ?", @author])
---
SELECT * FROM "pages" WHERE ("pages"."author" = 'jason') LIMIT 1

  def new
    @user = User.find_by_id(params[:user_id])
    @page = Page.create({'user_id'=>@user.id, 'title'=> ""})
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
INSERT INTO "pages" ("created_at", "title", "updated_at", "user_id", "root") VALUES('2010-10-06 04:07:59', '', '2010-10-06 04:07:59', NULL, NULL)

  def show
    @user = User.find_by_id(params[:user_id])
    @page = Page.find_by_id(params[:page_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "pages" WHERE ("pages"."id" IS NULL) LIMIT 1

  def load
    @user = User.find_by_id(params[:user_id])
    @page = Page.find_by_id(params[:page_id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT * FROM "pages" WHERE ("pages"."id" = '4') LIMIT 1

  def save
    user_id = params[:user_id]
    page_id = params[:page_id]
    uid = params[:uid]

    j = ActiveSupport::JSON
    @data = j.decode(params['data'])
    @page = uid ? Page.find_by_uid(uid) : Page.find(page_id)
---
SELECT * FROM "pages" WHERE ("pages"."uid" = 'LQg4sqX') LIMIT 1

  def load_page (page, version)


    version = version ? version.to_i : page.get_version
    boxes = page.boxs.select {|i| i.version == version}
    boxes.map! {|i| {:id => i.b_id, :width => i.width, :min_height => i.min_height, :content => i.content}}
    boxes_h = Hash.new
    boxes.each {|i| boxes_h[i[:id]] = i}

    containers = page.containers.select {|i| i.version == version}
---
SELECT * FROM "boxes" WHERE ("boxes".page_id = 29) LIMIT 1
SELECT * FROM "containers" WHERE ("containers".page_id = 4)