app/controllers/pages_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @user = User.find_by_id(params[:user_id])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
DELETE FROM "containers" WHERE "id" = 2
DELETE FROM "boxes" WHERE "id" = 1
UPDATE "pages" SET "updated_at" = '2010-10-06 03:31:04', "title" = ' Add Page Title ', "root" = 4 WHERE "id" = 4
INSERT INTO "boxes" ("page_id", "width", "min_height", "content", "created_at", "updated_at", "b_id", "version") VALUES(73, 1000, 200, 'afadsaf<div><br></div><div>adfadsf</div>', '2010-11-29 00:00:10', '2010-11-29 00:00:10', 1, 2)
---
  def save
    j = ActiveSupport::JSON
    @user = User.find_by_id(params[:user_id])
    @page = Page.find_by_id(params[:page_id])
    @data = j.decode(params['data'])
    @boxes = @data['box']
    @containers = @data['container']


    @page.containers.destroy_all
    @page.boxs.destroy_all
    @page.root = @data['root_id']
    @page.title = @data['page_title']
    @page.save


    @boxes.each do |key, box|
      b = Box.new
      b.b_id = box['id']
      b.page_id = params[:page_id]
      b.width = box['width']
      b.min_height = box['min_height']
      b.content = box['content']
      b.save

INSERT INTO "containers" ("page_id", "c_type", "a_child", "b_child", "created_at", "updated_at", "c_id", "c_position", "version") VALUES(73, 'simple', 1, NULL, '2010-11-29 00:00:10', '2010-11-29 00:00:10', 1, 'b', 2)
---
      c.b_child = container['b_child']
      c.c_id = container['id']
      c.c_position = container['position']
      c.save