app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "remember_token", "login", "email") VALUES('', 'baf2b555c9346715e77bd8f74049e8190401b438', '2010-09-26 14:28:41', NULL, '3f6e4ad13b526645a4e46d2458c8286725bd4e19', NULL, '2010-09-26 14:28:41', '5f034c37e2ac160a6eba384c3bb90c2bc50f649e', NULL, 'test_acct', 'jason.laster.11+1@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save